Функция СформироватьИнтернетПрофиль(УчетнаяЗаписьЭлектроннойПочты) Экспорт
	
	//сделал для теста gmail
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	профиль.ПортSMTP     =УчетнаяЗаписьЭлектроннойПочты.ПортSMTP;
	профиль.POP3ПередSMTP    =Ложь;
	профиль.АдресСервераIMAP    ="";
	профиль.АдресСервераPOP3    ="";
	профиль.АдресСервераSMTP=    УчетнаяЗаписьЭлектроннойПочты.SMTPСервер; 
	профиль.АутентификацияPOP3=СпособPOP3Аутентификации.Обычная;
	профиль.АутентификацияSMTP=СпособSMTPАутентификации.ПоУмолчанию;
	профиль.ИспользоватьSSLIMAP    = Ложь;
	профиль.ИспользоватьSSLPOP3    = Ложь;
	профиль.ИспользоватьSSLSMTP    = Истина;
	профиль.Пароль    =УчетнаяЗаписьЭлектроннойПочты.Пароль;
	профиль.ПарольIMAP    ="";
	профиль.ПарольSMTP    = УчетнаяЗаписьЭлектроннойПочты.Пароль;
	профиль.Пользователь    =УчетнаяЗаписьЭлектроннойПочты.Логин; 
	профиль.ПользовательIMAP    ="";
	профиль.ПользовательSMTP =    УчетнаяЗаписьЭлектроннойПочты.Логин;
	профиль.ПортIMAP    =0;
	профиль.ПортPOP3=    0;
	профиль.Таймаут    = 60;
	профиль.ТолькоЗащищеннаяАутентификацияIMAP    =Ложь;
	профиль.ТолькоЗащищеннаяАутентификацияPOP3    =Ложь;
	профиль.ТолькоЗащищеннаяАутентификацияSMTP    =Ложь;
	Возврат Профиль;
	
	
	
КонецФункции
